<?php

return [

    /*
    |--------------------------------------------------------------------------
    | العناوين (تسميات الإجراءات في الواجهة)
    |--------------------------------------------------------------------------
    */

    'title' => [

    "image" => "حذف الصورة",
"file" => "حذف الملف",
        /*
        |--------------------------------------------------------------------------
        | إجراءات الحذف
        |--------------------------------------------------------------------------
        */
        'delete' => [

            // عام
            'user' => 'حذف المستخدم',
            'message' => 'حذف الرسالة',
            'slider' => 'حذف العرض التقديمي',
            'slide' => 'حذف الشريحة',

            // هيكل التطبيق
            'establishment' => 'حذف المؤسسة',
            'wilaya' => 'حذف الولاية',
            'daira' => 'حذف الدائرة',
            'commune' => 'حذف البلدية',

            // الهيكل المهني
            'field' => 'حذف المجال المهني',
            'field_grade' => 'حذف مستوى الدرجة',
            'field_specialty' => 'حذف التخصص المهني',
            'service' => 'حذف القسم',

            // الجداول
            'schedule' => 'حذف الجدول',
            'schedule_day' => 'حذف يوم الجدول',
            'medical_exam' => 'حذف الفحص الطبي للمريض',
        ],

        /*
        |--------------------------------------------------------------------------
        | إجراءات الجداول
        |--------------------------------------------------------------------------
        */
        'schedule' => [
            'publish' => 'نشر الجدول',
            'generate_days' => 'إنشاء أيام الجدول',

            'generate_slots' => [
                "one" => "إنشاء الفترات",
                "all" => "إنشاء الفترات لجميع الأيام"
            ]
        ],

        "slot" => [
            "block" => "حظر الفترة",
            "unblock" => "إلغاء حظر الفترة",
            "book" => "حجز موعد",
        ],
        /*
        |--------------------------------------------------------------------------
        | إجراءات الأدوار / الصلاحيات
        |--------------------------------------------------------------------------
        */
        'roles' => [
            'detach' => [
                'coordinator' => 'إزالة المنسق',
                'appointments_location_agent' => 'إزالة الوكيل',
                'doctor' => 'إزالة الطبيب',
                'medical_secretary' => 'إزالة السكرتيرة',
            ],
        ],

        /*
        |--------------------------------------------------------------------------
        | إجراءات المواعيد
        |--------------------------------------------------------------------------
        */
        'appointment' => [

            'cancel' => 'إلغاء الموعد',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | التأكيدات
    |--------------------------------------------------------------------------
    */

    'confirmation' => [

        /*
        |--------------------------------------------------------------------------
        | تأكيدات الحذف
        |--------------------------------------------------------------------------
        */
        'delete' => [
"file" => 'هل أنت متأكد من أنك تريد حذف الملف ":attribute" نهائيًا؟',
"image" => 'هل أنت متأكد من أنك تريد حذف الصورة ":attribute" نهائيًا؟',
            // عام
            'user' => 'هل أنت متأكد من أنك تريد حذف المستخدم ":attribute" نهائيًا؟',
            'message' => 'هل أنت متأكد من أنك تريد حذف الرسالة من ":attribute" نهائيًا؟',
            'slider' => 'هل أنت متأكد من أنك تريد حذف العرض التقديمي ":attribute" نهائيًا؟',
            'slide' => 'هل أنت متأكد من أنك تريد حذف الشريحة ":attribute" نهائيًا؟',

            // هيكل التطبيق
            'establishment' => 'هل أنت متأكد من أنك تريد حذف المؤسسة ":attribute" نهائيًا؟',
            'wilaya' => 'هل أنت متأكد من أنك تريد حذف الولاية (الرمز: :attribute) نهائيًا؟',
            'daira' => 'هل أنت متأكد من أنك تريد حذف الدائرة (الرمز: :attribute) نهائيًا؟',
            'commune' => 'هل أنت متأكد من أنك تريد حذف البلدية (الرمز: :attribute) نهائيًا؟',

            // الهيكل المهني
            'field' => 'هل أنت متأكد من أنك تريد حذف المجال المهني ":attribute" نهائيًا؟',
            'field_grade' => 'هل أنت متأكد من أنك تريد حذف مستوى الدرجة ":attribute" نهائيًا؟',
            'field_specialty' => 'هل أنت متأكد من أنك تريد حذف التخصص المهني ":attribute" نهائيًا؟',
            'service' => 'هل أنت متأكد من أنك تريد حذف القسم ":attribute" نهائيًا؟',

            // الجداول
            'schedule' => 'هل أنت متأكد من أنك تريد حذف الجدول ":attribute" نهائيًا؟',
            'schedule_day' => 'هل أنت متأكد من أنك تريد حذف يوم الجدول بتاريخ ":attribute" نهائيًا؟',
            'medical_exam' => 'هل أنت متأكد من أنك تريد حذف الفحص الطبي للمريض المنشأ في ":attribute" نهائيًا؟',
        ],

        /*
        |--------------------------------------------------------------------------
        | تأكيدات الجداول
        |--------------------------------------------------------------------------
        */
        'schedule' => [

            'publish' =>
            'هل أنت متأكد من رغبتك في نشر الجدول ":attribute"؟ بعد النشر، يمكن فقط إضافة التواريخ؛ لا يمكن تعديل أو حذف التواريخ الموجودة.',

            'generate_days' =>
            'أنت على وشك إنشاء أيام التقويم للجدول ":attribute". بعد الإنشاء، لن يكون من الممكن تعديل أيام العمل أو فترات العمل أو أيام الإجازة. هل تريد المتابعة؟',

            'generate_slots' => [

                'one' =>
                'هل أنت متأكد من رغبتك في إنشاء الفترات لـ ":attribute"؟ سيتم قفل اليوم المحدد بعد الإنشاء.',

                'all' =>
                'هل أنت متأكد من رغبتك في إنشاء الفترات لجميع أيام الجدول ":attribute"؟ سيتم قفل أيام التقويم بعد الإنشاء ولا يمكن تعديلها.',
            ],
        ],

        "slot" => [
            "block" => "تعيين هذه الفترة كغير متاحة؟ لن يتمكن المرضى من حجزها.",
            "unblock" => "تعيين هذه الفترة كمتاحة؟ يمكن للمرضى حجزها.",
            "book" => "يرجى تأكيد موعدك بتاريخ :date الساعة :start_at.",
        ],
        /*
        |--------------------------------------------------------------------------
        | تأكيدات الأدوار
        |--------------------------------------------------------------------------
        */
        'roles' => [
            'detach' => [
                'coordinator' =>
                'هل أنت متأكد من رغبتك في فصل المنسق ":attribute"؟',

                'appointments_location_agent' =>
                'هل أنت متأكد من رغبتك في فصل وكيل موقع الموعد ":attribute"؟',

                'doctor' =>
                'هل أنت متأكد من رغبتك في فصل الطبيب ":attribute"؟',

                'medical_secretary' =>
                'هل أنت متأكد من رغبتك في فصل السكرتيرة الطبية ":attribute"؟',
            ],
        ],

        /*
        |--------------------------------------------------------------------------
        | تأكيدات المواعيد
        |--------------------------------------------------------------------------
        */
        'appointment' => [
            'cancel' => 'تأكيد إلغاء موعدك بتاريخ :date الساعة :start_at؟',
        ],
    ],
];
