<?php
return [
    "is_active" => [
        "all" => "-- جميع الحالات --",
        "active" => "النشط فقط",
        "inactive" => "غير النشط فقط"
    ],
    "default" => [

        "users" => "-- اختر مستخدمًا --",

        /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////           App

        "specialties" => "-- اختر التخصص الطبي --",
        'employees' => "-- اختر موظفين --",
        'coordinators' => "-- اختر منسقًا --",
        'doctors' => "-- اختر طبيبًا --",
        "head_of_service" => "-- اختر رئيس القسم --",
        "services" => "-- اختر القسم --",
        'medicalSecretaries' => "-- اختر سكرتيرة طبية --",
        "dairates" => "-- اختر دائرة --",
        "field_specialties" => "-- اختر التخصصات الطبية --",
        'appointments_dates' => "-- اختر تاريخًا --",
        'appointments_locations' => "-- اختر موقع الموعد --",
        'communes' => "-- اختر بلدية --",
        "fathers" => "-- اختر الأب --",
        "mothers" => "-- اختر الأم --",
    ]
];
