<?php

return [
    "common" => [
        "filters" => "فتح المرشحات",
        "resetFilters" => "إعادة تعيين المرشحات",
        "resetForm" => "إعادة تعيين النموذج",
        "add" => "إضافة جديد",
        "update" => "تحديث",
        'per_page' => "لكل صفحة",
        "previous" => [
            "page" => "الصفحة السابقة"
        ],
        "manage" => [
            "sliders" => "إدارة العروض التقديمية",
            "articles" => "إدارة المقالات",
        ],
    ],

    'image' => [
        "delete" => "حذف الصورة",
        "update" => "تحديث الصورة",
    ],
    'file' => [
        "delete" => "حذف الملف",
        "update" => "تحديث الملف",
    ],

    "user" => [
        "delete" => "حذف هذا المستخدم",
        "update" => "تحديث هذا المستخدم",
        "manage" => [
            "roles" => "إدارة أدوار المستخدم",
            "occupations" => "إدارة مهن المستخدم",
            "banking_information" => "إدارة المعلومات البنكية للمستخدم",
            'users' => "إضافة موظفين"
        ],
        "excel" => [
            "empty" => "إنشاء ملف Excel فارغ للمستخدمين",
            "download" => "تصدير ملف Excel للمستخدمين",
            "upload" => "استيراد ملف Excel للمستخدمين",
        ]
    ],



    "message" => [
        "delete" => "حذف هذه الرسالة",
        "reply" => "الرد على هذه الرسالة"
    ],



    "slider" => [
        "delete" => "حذف هذا العرض التقديمي",
        "update" => "تحديث هذا العرض التقديمي",
        'manage' => "إضافة شرائح"
    ],

    "slide" => [
        "delete" => "حذف هذه الشريحة",
        "update" => "تحديث هذه الشريحة"
    ],

    //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////// App
    "person" => [
        "delete" => "حذف الموظف",
        "update" => "تعديل الموظف",
        "manage" => [
            "account" => "إدارة الحساب",
            "occupations" => "إدارة المهن",
            "banking_information" => "إدارة المعلومات البنكية",
            'persons' => "إضافة موظفين"
        ],
        "excel" => [
            "empty" => "تحميل القالب",
            "download" => "التصدير إلى Excel",
            "upload" => "الاستيراد من Excel",
        ]
    ],


    "wilaya" => [
        "delete" => "حذف الولاية",
        "update" => "تحديث الولاية",
        "manage" => [
            "view" => "عرض تفاصيل الولاية",
        ],
        "excel" => [
            "empty" => "تحميل القالب",
            "download" => "تصدير بيانات الولاية",
            "upload" => "استيراد بيانات الولاية"
        ]
    ],

    "daira" => [
        "delete" => "حذف الدائرة",
        "update" => "تحديث الدائرة",
        "manage" => [
            "communes" => "إدارة البلديات",
        ],
        "excel" => [
            "empty" => "تحميل القالب",
            "download" => "تصدير بيانات الدائرة",
            "upload" => "استيراد بيانات الدائرة"
        ]
    ],

    "commune" => [
        "delete" => "حذف البلدية",
        "update" => "تحديث البلدية",
        "excel" => [
            "empty" => "تحميل القالب",
            "download" => "تصدير بيانات البلدية",
            "upload" => "استيراد بيانات البلدية"
        ]
    ],

    "field" => [
        "delete" => "حذف المجال",
        "update" => "تحديث المجال",
        "manage" => [
            "specialties" => "إدارة تخصصات المجال",
            "grades" => "إدارة مستويات الدرجات",
            'fields' => "تعيين مجالات"
        ],
        "excel" => [
            "empty" => "تحميل القالب",
            "download" => "تصدير بيانات المجال",
            "upload" => "استيراد بيانات المجال"
        ]
    ],

    "field_grade" => [
        "delete" => "حذف مستوى الدرجة",
        "update" => "تحديث مستوى الدرجة",
        "manage" => [
            'fields' => "تعيين مجالات مهنية"
        ],
        "excel" => [
            "empty" => "تحميل القالب",
            "download" => "تصدير بيانات الدرجة",
            "upload" => "استيراد بيانات الدرجة"
        ]
    ],

    "field_specialty" => [
        "delete" => "حذف التخصص",
        "update" => "تحديث التخصص",
        "manage" => [
            'fields' => "تعيين تخصصات مهنية"
        ],
        "excel" => [
            "empty" => "تحميل القالب",
            "download" => "تصدير بيانات التخصص",
            "upload" => "استيراد بيانات التخصص"
        ]
    ],

    "occupation" => [
        "delete" => "حذف هذه المهنة",
        "update" => "تحديث هذه المهنة"
    ],


    'establishment' => [
        "delete" => "حذف المؤسسة",
        "update" => "تحديث المؤسسة",
        "map" => "عرض المؤسسة على خرائط Google",
        "manage" => [
            "view" => "عرض تفاصيل المؤسسة",
            "bulk_insert" => "استيراد جماعي للمؤسسات"
        ],
        "excel" => [
            "empty" => "تحميل القالب الفارغ",
            "download" => "تصدير بيانات المؤسسات",
            "upload" => "استيراد بيانات المؤسسات"
        ]
    ],

    'service' => [
        "delete" => "حذف القسم",
        "update" => "تحديث القسم",
        "manage" => [
            "view" => "عرض تفاصيل القسم",
            "bulk_insert" => "استيراد جماعي للأقسام",
            "coordinators" => "إدارة المنسقين",
        ],
        "excel" => [
            "empty" => "تحميل القالب",
            "download" => "تصدير بيانات الأقسام",
            "upload" => "استيراد بيانات الأقسام"
        ]
    ],

    "establishment-admin" => [
        "ban" => "إزالة دور المنسق",
    ],

    'coordinator' => [
        "detach" => [
            "doctor" => "فصل الطبيب",
            "medical_secretary" => "فصل السكرتيرة الطبية"
        ]
    ],
    'appointments-location-admin' => [
        "ban" => "إزالة دور مدير موقع المواعيد",
    ],

    'schedule' => [
        "delete" => "حذف الجدول",
        "update" => "تعديل الجدول",
        "publish" => "نشر الجدول",
        "manage" => [
            "view" => "عرض تفاصيل الجدول",
            "generate" => "إنشاء أيام الجدول"
        ],
    ],

    'schedule_day' => [
        "delete" => "حذف",
        "update" => "تعديل",
        "view" => "الفترات",
        "generate" => [
            "for_one" => "إنشاء",
            "for_all" => "إنشاء للكل"
        ]
    ],

    'schedule_slot' => [
        "block" => "حظر هذه الفترة",
        "unblock" => "إلغاء حظر هذه الفترة",
        "book" => "حجز هذه الفترة",
        "options" => [
            "expand" => "توسيع معايير الحجز",
            "reset" => "إعادة تعيين",
        ]
    ],
    'appointment' => [
        "cancel" => "إلغاء الموعد",
        "get_confirmation" => "تحميل وثيقة التأكيد",
        "location" => "خريطة موقع الموعد",
        'referral_letter' => "عرض خطاب التحويل",
        "export" => "تحميل قائمة مواعيد :date",
        'follow-up' => "حجز موعد متابعة"
    ],
    'patient' => [
        "delete" => [
            "relative" => "إزالة قريبي",
            "patient" => "إزالة المريض",
        ],
        "update" => [
            "relative" => "تحديث معلومات قريبي",
            "patient" => "تحديث معلومات المريض"
        ],
        "view" => [
            "exam" => "قائمة فحوصات المريض",
            "relative" => "إدارة مواعيد قريبي",
            "patient" => "إدارة مواعيد المريض"
        ],
        "print_opened_by" => 'طباعة معلومات الحساب'
    ],
    'patient_visit' => [
        "delete" => "حذف تقرير زيارة المريض",
        "update" => "تحديث تقرير زيارة المريض",
        "manage" => [
            "images" => "إدارة مستندات زيارة المريض (صور)",
            "files" => "إدارة مستندات زيارة المريض (ملفات PDF)",
        ],
    ],
];
